In [2]:
# Dependencies
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [3]:
# Import CSVs
city_csv = "city_data.csv"
ride_csv = "ride_data.csv"

In [4]:
# Read CSVs
city_data = pd.read_csv(city_csv)
ride_data = pd.read_csv(ride_csv)

In [5]:
city_data.head()

             city  driver_count   type
0      Kelseyland            63  Urban
1      Nguyenbury             8  Urban
2    East Douglas            12  Urban
3   West Dawnfurt            34  Urban
4  Rodriguezburgh            52  Urban

In [6]:
ride_data.head()

          city                 date   fare        ride_id
0     Sarabury  2016-01-16 13:49:27  38.35  5403689035038
1    South Roy  2016-01-02 18:42:34  17.49  4036272335942
2  Wiseborough  2016-01-21 17:35:29  44.18  3645042422587
3  Spencertown  2016-07-31 14:53:22   6.87  2242596575892
4   Nguyenbury  2016-07-09 04:42:44   6.28  1543057793673

In [8]:
# Combine data
merged_data = pd.merge(city_data, ride_data, how = "left", on = ["city","city"])
merged_data.head()

         city  driver_count   type                 date   fare        ride_id
0  Kelseyland            63  Urban  2016-08-19 04:27:52   5.51  6246006544795
1  Kelseyland            63  Urban  2016-04-17 06:59:50   5.54  7466473222333
2  Kelseyland            63  Urban  2016-05-04 15:06:07  30.54  2140501382736
3  Kelseyland            63  Urban  2016-01-25 20:44:56  12.08  1896987891309
4  Kelseyland            63  Urban  2016-08-09 18:19:47  17.91  8784212854829

In [9]:
# Urban
urban = merged_data[merged_data[type] == "Urban"]

In [ ]:
# Suburban
suburban = merged_data[merged_data[type] == "Suburban"]

In [ ]:
# Rural
rural = merged_data[merged_data[type] == "Rural"]